//중간고사 실시 안내

//1. 시간 / 장소
//-자료구조프로그래밍: 10월 23일(수), 15 : 00~17 : 00 (2시간) / 12호관 209호

//2. 참고사항
//-시험범위는 Chap. 1.~ 8.
//- 시험은 오픈북입니다. (교재만 허용됨.프린트물 등은 참고 불가)
//- 실습PC / 개인노트북 사용 가능, USB에 소스코드 등 저장 사용 가능
//- 실기 시험시 개발환경은 시험 전 미리 설치 및 작동 확인 하세요. (옆자리 착석 불가)
//* 시험 중 부정행위 적발시 F학점이 부여됩니다.
//주의: 스마트폰 사용, PC에서 이메일 / 메신저 등 통신 수단 사용시 내용에 관계 없이 부정행위로 간주함.

//	시험 문제 범위 및 유형 :
//-recursion, stack permutation, random walk, min / max heap, BST, graph path, hash table 등

//- 상기 범위에서 자료구조의 응용 여부를 묻는 문제 유형 1~3문제
//예) 1보다 크거나 같고 n보다 작거나 같은 서로 다른 n - 1개의 숫자가 주어졌을 때,
//이 범위에서 생략된 숫자의 값을 구하는 알고리즘의 시간 복잡도는 ? 그 이유는 ?
//(단, 알고리즘의 공간 복잡도는 O(1)이어야 한다)

//-상기 범위에서 실습 코드를 응용하여 풀 수 있는 문제 유형 3~5문제
//예) 다음과 같은 n개의 숫자를 min heap에 insert했을 때의 결과를 그림으로 그리고,
//이 min heap을 postorder로 traverse한 순서대로 BST에 insert한 결과를 그림으로 그리시오.